graphql-api/libs/data/test.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:con="https://consumerconnectws.tui.transunion.com/"
  xmlns:data="https://consumerconnectws.tui.transunion.com/data">
  <soapenv:Header/>
  <soapenv:Body>
    <con:GetAuthenticationQuestions>
      <con:request>
        <data:AccountCode>M2RVc0ZZM0Rwd2FmZA</data:AccountCode>
        <data:AccountName>CC2BraveCredit</data:AccountName>
        <data:RequestKey>BC-d5b412d9-bcab-4798-8974-b6d1977cc5a2</data:RequestKey>
        <data:ClientKey>680126d9-b9b1-45a2-b6e0-1de2c9c133cb</data:ClientKey>
        <data:Customer>
          <data:CurrentAddress>
            <data:AddressLine1>1071 101st</data:AddressLine1>
            <data:AddressLine2 xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:City>Hollywood</data:City>
            <data:State>FL</data:State>
            <data:Zipcode>33025</data:Zipcode>
          </data:CurrentAddress>
          <data:DateOfBirth>1957-09-01</data:DateOfBirth>
          <data:FullName>
            <data:FirstName>Thomas</data:FirstName>
            <data:LastName>Testt</data:LastName>
            <data:MiddleName xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:Prefix xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <data:Suffix xsi:nil="true"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
          </data:FullName>
          <data:PhoneNumber>4045049006</data:PhoneNumber>
          <data:Ssn>899010020</data:Ssn>
        </data:Customer>
        <data:Email xsi:nil="true"
          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
        <data:Language xsi:nil="true"
          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
        <data:ServiceBundleCode>CC2BraveCreditAuthentication</data:ServiceBundleCode>
        <data:TrustSessionId xsi:nil="true"
          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
      </con:request>
    </con:GetAuthenticationQuestions>
  </soapenv:Body>
</soapenv:Envelope>